dataset_gen/OpenFoam_Shapes/Rectangle/design_points/design_point_2/0/Ccx
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ccx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
9600
(
-3.2950632
-3.0475548
-2.8000464
-2.552538
-2.3050296
-2.0575212
-1.8100127
-1.5625043
...
)
;

boundaryField
{
    FrontBack
    {
        type            empty;
    }
    Cylinder
    {
        type            calculated;
        value           nonuniform List<scalar> 
160
(
0.55635089
0.60635089
0.65635089
0.70635089
0.75635089
0.80635089
0.85635089
0.90635089
...
)
;
    }
    Bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
-3.3436491
-3.0936491
-2.8436491
-2.5936491
-2.3436491
-2.0936491
-1.8436491
-1.5936491
...
)
;
    }
    Top
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
6.4063509
6.1563509
5.9063509
5.6563509
5.4063509
5.1563509
4.9063509
4.6563509
...
)
;
    }
    Inlet
    {
        type            calculated;
        value           uniform -15;
    }
    Outlet
    {
        type            calculated;
        value           uniform 15;
    }
}


// ************************************************************************* //
